Revit 2027 API
RenderingQualitySettings.RenderLevel Property
 The render target level as a numerical value between 1 and 40.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int RenderLevel { get; set; }
Public Property RenderLevel As Integer
	Get
	Set
public:
property int RenderLevel {
	int get ();
	void set (int value);
}
member RenderLevel : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The value is not valid for RenderLevel.
InvalidOperationException |  When setting this property: The RenderingQualitySettings does not use custom quality currently. To use custom quality, set RenderingQuality property to RenderingQuality.Custom.
Remarks
 Increase this value to increase render level.
See Also
Reference
RenderingQualitySettings Class
Autodesk.Revit.DB Namespace